app/Controllers/ServerApi.php

    public function getDataStaff()
    {
        $query = $this->db->table('tb_staff')->get();
---
SELECT *
FROM `tb_staff`